<template>
  <v-dialog v-model="dialog" width="500">
    <template v-slot:activator="{ on }">
      <v-btn
        color="lighten-2"
        dark
        style="background : #68ae41 !important"
        v-on="on"
      >
        مشاهده قرارداد
      </v-btn>
    </template>

    <v-card>
      <v-card-title
        style="text-align:center;border-radius: 15px 15px 0px 0px;font-size:20px"
        class="font-weight-black grey aniback white--text"
      >
        <p class="my-0" style="width:100%">قرارداد</p>
      </v-card-title>
      <v-card-text style="padding: 5px 20px;">
        1- مشاوره آنلاین، صرفا از ساعت 7 تا 24 ارائه می شود.
      </v-card-text>
      <v-card-text style="padding: 5px 20px;">
        2- رزرو نوبت مشاوره از ساعت 7 تا 24 قابل انجام است.
      </v-card-text>
      <v-card-text style="padding: 5px 20px;">
        3- زمان ارائه مشاوره حضوری در آنی مشاور از ساعت 9 تا 20 خواهد بود.
      </v-card-text>
      <v-card-text style="padding: 5px 20px;">
        4- زمان ارائه مشاوره تلفنی و نوشتاری (چت) در آنی مشاور از ساعت 7 تا 24
        خواهد بود.
      </v-card-text>
      <v-card-text style="padding: 5px 20px;">
        5- آخرین ساعت رزرو مشاوره نوشتاری در آنی مشاور ساعت 23:30 و حداکثر زمان
        قابل انتخاب برای مشاوره نوشتاری در این بازه زمانی، فقط نیم ساعت خواهد
        بود.
      </v-card-text>
      <v-card-text style="padding: 5px 20px;">
        6- به طور کلی در آنی مشاور، رزرو وقت مشاوره نوشتاری یا تلفنی در هر زمانی
        که انجام شود مشاوره نوشتاری یا تلفنی به طور خودکار در راس ساعت 24 قطع
        خواهد شد.
      </v-card-text>
      <v-card-text style="padding: 5px 20px;">
        7- مشاوره حضوری در روزهای غیرتعطیل شنبه تا 4 شنبه از ساعت 9 الی 20 در
        نیمه نخست سال و از ساعت 9 تا 18 در نیمه دوم سال در تهران، میدان هفت تیر،
        ابتدای خیابان بهارشیراز، نرسیده به خیابان سلیمان خاطر، جنب اداره پست،
        پلاک ۴، طبقه ۴ واحد ۱۱ یا هر محل دیگری که آنی مشاور تعیین می نماید قابل
        ارائه می باشد.
      </v-card-text>
      <v-card-text style="padding: 5px 20px;">
        8- وجه مشاوره (حق المشاوره) پیش از آغاز مشاوره آنلاین یا در هنگام رزرو
        نوبت مشاوره، دریافت می شود.
      </v-card-text>
      <v-card-text style="padding: 5px 20px;">
        9- اگر کاربر به هر دلیلی در موعد رزرو شده، در اتاق مشاوره حضور پیدا نکند
        با عنایت به اینکه عدم انجام مشاوره ناشی از عدم حضور کاربر بوده است هیچ
        مبلغی به کاربر، مسترد نخواهد شد.
      </v-card-text>
      <v-card-text style="padding: 5px 20px;">
        10- لغو نوبت مشاوره تا دو روز پیش از نوبت مشاوره، بدون کسر مبلغ، امکان
        پذیر خواهد بود.
      </v-card-text>
      <v-card-text style="padding: 5px 20px;">
        11- لغو نوبت مشاوره در یک روز پیش از نوبت مشاوره با کسر 25 درصد از وجه
        پرداختی، امکان پذیر خواهد بود.
      </v-card-text>
      <v-card-text style="padding: 5px 20px;">
        12- نظر به اینکه لغو نوبت مشاوره از سوی کاربران، سبب ایجاد اختلال در
        برنامه کاری مشاوران و کارکرد صحیح آنی مشاور می گردد از این رو، اگر کاربر
        بیش از دو نوبت اقدام به لغو رزرو نوبت مشاوره نماید تا سه نوبت بعدی هزینه
        رزرو مشاوره او ده درصد بالاتر از هزینه معمول، محاسبه خواهد شد.
      </v-card-text>
      <v-card-text style="padding: 5px 20px;">
        13- در صورت لغو مشاوره درخواستی کاربر از سوی مشاور یا آنی مشاور کل وجه
        پرداختی کاربر به حساب کاربری او یا به حساب بانکی اعلام شده از سوی او
        واریز و منظور خواهد شد.
      </v-card-text>
      <v-card-text style="padding: 5px 20px;">
        14- در جهت بررسی کیفیت مشاوره ها و برنامه ریزی برای ارائه مشاوره های
        بهتر، همه مکالمه ها و اطلاعات مبادله شده از سوی آنی مشاور ضبط و حفظ می
        شود و به صورت کاملاً محرمانه نگهداری می گردد .
      </v-card-text>
      <v-card-text style="padding: 5px 20px;">
        15- آنی مشاور به منظور حفظ کیفیت مشاوره ها باور دارد که مشاورانش پس از
        دو ساعت مشاوره متوالی باید نیم ساعت، فرصت استراحت فکری و جسمی داشته
        باشند و به همین دلیل، امکان رزرو مشاوره متوالی بیش از دو ساعت برای یک
        مشاور را فراهم نمی کند. پس از هر دو ساعت مشاوره متوالی، طی یک فاصله نیم
        ساعته به منظور استراحت مشاور، امکان رزرو نوبت مشاوره وجود نخواهد داشت.
      </v-card-text>
      <v-card-text style="padding: 5px 20px;">
        16- آنی مشاور، به طور کلی، مسئولیتی در قبال عدم نگهداری ایمن نام کاربری
        و رمز عبور و تغییر شماره تلفن همراه کاربران ندارد. با این وجود، آنی
        مشاور بنا به خط مشی همیشگی خود برای بروزرسانی مستمر اطلاعات و داده های
        لازم برای حفظ ارتباط با کاربران، طی دوره های منظم یا در هنگام ارائه
        سرویس ها و خدمات خود یا در هر زمان که ضرورت داشته باشد از کاربران خواهد
        خواست که با ورود به پنل کاربری خویش، تغییر شماره تلفن همراه یا تغییر در
        حساب و رمز عبور خود را برابر رویه آنی مشاور اعمال نمایند.
      </v-card-text>
      <v-card-text style="padding: 5px 20px;">
        17- فعالیت افرادی که برای آنی مشاور محرز گردد غیر رشید و محجور هستند در
        آنی مشاور ممنوع می باشد.
      </v-card-text>
      <v-card-text style="padding: 5px 20px;">
        18- ثبت نام مشاور و کاربر به خودی خود به معنی آن است که مشاوران و
        کاربران برابر قانون یا احکام قضایی و قانونی از فعالیت در فضای مجازی و
        ارائه یا دریافت خدمات مشاوره در فضای مجازی و بستر الکترونیکی منع نشده
        اند. تخلف از این شرط، حق درخواست جبران خسارات وارده را برای آنی مشاور و
        افراد و...در پی خواهد داشت. در هر زمان که آنی مشاور تشخیص دهد که کاربران
        یا مشاوران دارای منع قانونی یا قضایی در این زمینه هستند ضمن مسدود نمودن
        حساب کاربری آنان، ارائه خدمات آنی مشاور به آنان و فعالیت آنان در آنی
        مشاور را بلافاصله، متوقف و خسارات و ناشی از تخلف آنان از شروط اعلامی آنی
        مشاور از جمله شروط و تعهدات هنگام ثبت نام و این تعهدات را مطالبه خواهد
        نمود.
      </v-card-text>
      <v-card-text style="padding: 5px 20px;">
        19- ثبت نام مشاور و کاربر در آنی مشاور به خودی خود به معنی آن است که
        مشاوران و کاربران در انجام مشاوره به هر شکل که باشد ملتزم به رعایت ادب و
        احترام نسبت به یکدیگر و نسبت به همه افراد و اشخاص می باشند و از مبادله
        پیام و مستندات و مدارکی که مرتبط با موضوع مشاوره نیست یا برابر قوانین
        جمهوری اسلامی ایران وصف و عنوان مجرمانه دارد در بستر آنی مشاور پرهیز می
        نمایند.
      </v-card-text>
      <v-card-text style="padding: 5px 20px;">
        20- ثبت نام مشاوران در آنی مشاور به خودی خود به منزله تعهد به ارائه
        مشاوره آنلاین، حداقل به میزان یک سوم کل زمان های ارائه مشاوره است.
      </v-card-text>

      <v-divider></v-divider>

      <v-card-actions>
        <v-spacer></v-spacer>
        <v-btn class="green white--text" flat="flat" @click="accept"
          >قرارداد را مطالعه کردم و پذیرفتم</v-btn
        >
        <v-btn class="red white--text" flat="flat" @click="close">بستن</v-btn>
      </v-card-actions>
    </v-card>
  </v-dialog>
</template>
<script>
export default {
  props: ['accepted'],
  data: () => ({
    dialog: false
  }),
  methods: {
    accept() {
      this.$emit('update:accepted', true)
      this.dialog = false
    },
    close() {
      this.dialog = false
    }
  }
}
</script>
